app/controllers/trails_controller.rb

    def index
        trails = Trail.all
---
SELECT "trails".* FROM "trails"

    def show
        trail = Trail.find(params[:id])
---
SELECT "trails".* FROM "trails" WHERE "trails"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

    def create
        trail = Trail.create!(trail_params)
---
INSERT INTO "trails" ("name", "img_url", "city", "length", "est_time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def update
        trail = Trail.find(params[:id])
        trail.update(likes: params[:likes])
---
SELECT "trails".* FROM "trails" WHERE "trails"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
UPDATE "trails" SET "updated_at" = $1, "likes" = $2 WHERE "trails"."id" = $3  [["updated_at", "2022-08-25 17:56:00.347363"], ["likes", 5], ["id", 26]]

    def destroy
        trail = Trail.find(params[:id])
        trail.destroy
---
SELECT "trails".* FROM "trails" WHERE "trails"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "trails" WHERE "trails"."id" = $1  [["id", 7]]